# GetNumAssociations

## Description
Get number of associations for specified object.

```pascal
FUNCTION GetNumAssociations(handle : HANDLE): INTEGER;
```

```python
def vs.GetNumAssociations(handle):
    return INTEGER
```

## Parameters
|Name|Type|Description|
|---|---|---|
|handle|HANDLE|Object handle.|

## Remarks
Number of associations of specified object.

## Version
Availability: from Vectorworks 2018

## Category
* Object Editing